# SQL with Python üêç

## Objectives

1. SQLAlchemy
2. Create a database connection (engine)
3. Run SQL statements
4. Reading and Writing tables with pandas
5. Creating Databases

# 1. SQLAlchemy üêç

SQLAlchemy provides tools for managing connections to a database, interacting with database queries and results, and construction of SQL statements in Python.

concept  |  description
---|---|
`sqlalchemy`      | high-level python library for managing all kinds of relational databases
`psycopg2`      |   low-level python library that actually manages the communication with a PostgreSQL DB
`create_engine()`      |   creates an `engine` that manages a conncetion to a DB
`'postgresql://<user>:<password>@<host>/<db>'` | the url, a string that contains all information needed to connect to a DB
`with engine.begin() as conn` | opens a database connection to read or write data
`conn.execute()` | submit arbitrary SQL statements to a DB
`df.to_sql(tablename, engine)` | write a pandas DataFrame into a table of a database
`pd.read_sql(tablename,engine)` | read a table as a DataFrame

https://www.sqlalchemy.org/

https://www.psycopg.org/docs/install.html

https://docs.sqlalchemy.org/en/14/dialects/postgresql.html#module-sqlalchemy.dialects.postgresql.psycopg2

https://pypi.org/project/python-dotenv/

## üíæ Installation

Install the required libraries with `pip`:

```bash
pip install sqlalchemy
pip install psycopg2-binary
```

- **`sqlalchemy`** is the generic high-level database interface for Python. You can use it to connect to many different relational databases.   
- **`psycopg2`** is the low-level database driver specifically for Postgres.  
Usually `psycopg2` is not imported explicitly but is required by `sqlalchemy` when working with a Postgres Database Server.

In [1]:
 !pip install sqlalchemy

#!pip install --upgrade sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.35-cp312-cp312-macosx_10_9_x86_64.whl.metadata (9.6 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/miniconda3/lib/python3.12/site-packages (from sqlalchemy) (4.12.2)
Collecting greenlet!=0.4.17 (from sqlalchemy)
  Downloading greenlet-3.1.1-cp312-cp312-macosx_11_0_universal2.whl.metadata (3.8 kB)
Downloading SQLAlchemy-2.0.35-cp312-cp312-macosx_10_9_x86_64.whl (2.1 MB)
   ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 2.1/2.1 MB 2.1 MB/s eta 0:00:00a 0:00:01
Downloading greenlet-3.1.1-cp312-cp312-macosx_11_0_universal2.whl (274 kB)
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-3.1.1 sqlalchemy-2.0.35

In [2]:
!pip install psycopg2-binary

Collecting psycopg2-binary
  Downloading psycopg2_binary-2.9.9-cp312-cp312-macosx_10_9_x86_64.whl.metadata (4.4 kB)
Downloading psycopg2_binary-2.9.9-cp312-cp312-macosx_10_9_x86_64.whl (2.8 MB)
   ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 2.8/2.8 MB 2.0 MB/s eta 0:00:00a 0:00:01
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.9.9

# 2. Create a database connection üîåüè¶

To access your database, SQLAlchemy needs a connection string. Connection strings consist of six parts:

part | description | default value
--- | --- | ---
dialect | The dialect/ flavour of the relational database | ...
host | IP address or name of the database server machine | localhost
port | network port on the host machine | 5432
database | the name of your database | postgres
user | the user name of the PostgreSQL Server | postgres
password | the password of the database user | ...

In [3]:
import pandas as pd
from sqlalchemy import create_engine, types
from sqlalchemy import text # to be able to pass string

### A ``connection string`` for postgresql could look like this:

```python
url = '<dialect>://<user>:<password>@<host>:<port>/<database>?currentSchema={schema}'
```

In [4]:
# Let's load values from the .env file
from dotenv import dotenv_values

config = dotenv_values()

# define variables for the login
pg_user = config['POSTGRES_USER']  # align the key label with your .env file !
pg_host = config['POSTGRES_HOST']
pg_port = config['POSTGRES_PORT']
pg_db = config['POSTGRES_DB']
pg_schema = config['POSTGRES_SCHEMA']
pg_pass = config['POSTGRES_PASS']

In [5]:
# Now building the URL with the values from the .env file

url = f'postgresql://{pg_user}:{pg_pass}@{pg_host}:{pg_port}/{pg_db}'

# without specifying the schema default connection is to the schema `public`
# url = f'postgresql://{pg_user}:{pg_pass}@{pg_host}:{pg_port}/{pg_db}'

### With a connection string we can create an ``engine``:

In [6]:
pg_schema

's_shaunkutsanzira'

In [7]:
engine = create_engine(url, echo=False)

The engine object manages connections to the database. It can be used to open new connections or to handle several connections at once.

In [8]:
# check your URL

engine.url # password is hidden

postgresql://shaunkutsanzira:***@data-analytics-course-2.c8g8r1deus2v.eu-central-1.rds.amazonaws.com:5432/hh_analytics_24_2

In [11]:
from sqlalchemy import inspect
inspector = inspect(engine)

In [12]:
inspector.get_table_names()

['flights',
 'flights_part',
 'airports',
 'airports_part',
 'life_expectancy',
 'regions',
 'messy_customer_data',
 'seminars']

### Logging

`sqlalchemy` and `psycopg2` translate python statements into SQL commands that a database server can understand.  
When creating the engine, you can set `echo=True` to print out all the raw SQL queries that are actually sent to the server in the background and are usually hidden from the Python programmer!

### Schema: 

because we use different schemas, we need to specify in which schema to search for the table

**Option 1** - using search_path parameter:
>```sql
>SET search_path TO your_schema;  
>```
**Option 2** - associating the table with the schema directly:
>```sql
>SELECT * FROM your_schema.students;
>```

<br>

<details>
<summary><b> SIDEBAR:</b> What is <code>search_path</code>?</summary>

In PostgreSQL, the <code>search_path</code> is a configuration parameter that determines the order in which schemas are searched when an object (like a table or function) is referenced by a simple, unqualified name.

**Links:**
- https://www.commandprompt.com/education/postgresql-schema-search-path/
- https://www.postgresql.org/docs/current/ddl-schemas.html#DDL-SCHEMAS-PATH

</details>

In [25]:
my_schema = 's_shaunkutsanzira'

with engine.begin() as conn: 
    result = conn.execute(text(f'SET search_path TO {my_schema};'))

# 3. Run SQL statements üîß‚úèÔ∏èüìö

With an `engine` defined we can now send plain SQL statements to the server.

***PREVIEW: Simple reading example***

In [17]:
with engine.begin() as conn: # Done with echo=False
    result = conn.execute(text(f'''
                               SELECT * FROM s_shaunkutsanzira.students; 
                                '''))
    data = result.all()

### Let's create a dataframe out of that
df = pd.DataFrame(data, columns=['...', '...', '...']) 
df

  ...     ...               ...
0   1    Anna    anna@gmail.com
1   2  Joseph  joseph@gmail.com
2   3  Scally  scally@gmail.com
3   4    Liam    liam@gmail.com
4   5    Elif    elif@gmail.com

In [18]:
with engine.begin() as conn: # Done with echo=False
    result = conn.execute(text(f'''
                               SELECT * FROM airports LIMIT 5;
                                '''))
    data = result.all()

### Let's create a dataframe out of that
df = pd.DataFrame(data) #, columns=['...', '...', '...']) 
df

,faa,name,lat,lon,alt,tz,dst,city,country
0,GKA,Goroka Airport,-6.081690,145.391998,5282,10.0,U,Goroka,Papua New Guinea
1,MAG,Madang Airport,-5.207080,145.789001,20,10.0,U,Madang,Papua New Guinea
2,HGU,Mount Hagen Kagamuga Airport,-5.826790,144.296005,5388,10.0,U,Mount Hagen,Papua New Guinea
3,LAE,Nadzab Airport,-6.569803,146.725977,239,10.0,U,Nadzab,Papua New Guinea
4,POM,Port Moresby Jacksons International Airport,-9.443380,147.220001,146,10.0,U,Port Moresby,Papua New Guinea

### üîß 3.1 Create a new table ``seminars``:

Connecting to a database works like opening a connection to a local file.  

The connection stays open within the `with` block and will be closed afterwards. 

`conn.execute` sends the SQL statement to the server and optionally 
returns a result set.

In [26]:
with engine.begin() as conn:
    conn.execute(text(f"""
        DROP TABLE IF EXISTS seminars;
        CREATE TABLE seminars (
            seminar_name VARCHAR PRIMARY KEY,
            seminar_start DATE,
            seminar_end DATE,
            instructor_id VARCHAR
        );    
    """))

>#### Check your Schema in DBeaver for changes

### ‚úèÔ∏è3.2 Insert some data:

Within a connection context we can send one or several statements at once:

In [27]:
# let's switch the logging on. because the engine is getting renewed we need to specify the schema again.
engine = create_engine(url, echo=True)

my_schema = 's_shaunkutsanzira'

with engine.begin() as conn: 
    result = conn.execute(text(f'SET search_path TO {my_schema};'))

2024-10-10 11:11:31,218 INFO sqlalchemy.engine.Engine select pg_catalog.version()
2024-10-10 11:11:31,221 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-10-10 11:11:31,282 INFO sqlalchemy.engine.Engine select current_schema()
2024-10-10 11:11:31,289 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-10-10 11:11:31,347 INFO sqlalchemy.engine.Engine show standard_conforming_strings
2024-10-10 11:11:31,348 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-10-10 11:11:31,402 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-10-10 11:11:31,406 INFO sqlalchemy.engine.Engine SET search_path TO s_shaunkutsanzira;
2024-10-10 11:11:31,414 INFO sqlalchemy.engine.Engine [generated in 0.00705s] {}
2024-10-10 11:11:31,478 INFO sqlalchemy.engine.Engine COMMIT

In [28]:
with engine.begin() as conn: # Done with echo=True
    conn.execute(text("INSERT INTO seminars VALUES ('art', '2024-03-23', '2024-05-23', 't23')"))
    conn.execute(text("INSERT INTO seminars VALUES ('ethics', '2024-03-17', '2024-04-05', 't12')"))
    conn.execute(text("INSERT INTO seminars VALUES ('engineering', '2024-10-09', '2024-11-08', 't45')"))
    conn.execute(text("INSERT INTO seminars VALUES ('politics', '2024-07-11', '2024-08-31', 't37')"))
    conn.execute(text("INSERT INTO seminars VALUES ('python', '2024-08-01', '2024-12-01', 't08')"))

2024-10-10 11:12:12,184 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-10-10 11:12:12,188 INFO sqlalchemy.engine.Engine INSERT INTO seminars VALUES ('art', '2024-03-23', '2024-05-23', 't23')
2024-10-10 11:12:12,200 INFO sqlalchemy.engine.Engine [generated in 0.01192s] {}
2024-10-10 11:12:12,492 INFO sqlalchemy.engine.Engine INSERT INTO seminars VALUES ('ethics', '2024-03-17', '2024-04-05', 't12')
2024-10-10 11:12:12,494 INFO sqlalchemy.engine.Engine [generated in 0.00203s] {}
2024-10-10 11:12:12,609 INFO sqlalchemy.engine.Engine INSERT INTO seminars VALUES ('engineering', '2024-10-09', '2024-11-08', 't45')
2024-10-10 11:12:12,665 INFO sqlalchemy.engine.Engine [generated in 0.05639s] {}
2024-10-10 11:12:12,798 INFO sqlalchemy.engine.Engine INSERT INTO seminars VALUES ('politics', '2024-07-11', '2024-08-31', 't37')
2024-10-10 11:12:12,803 INFO sqlalchemy.engine.Engine [generated in 0.00476s] {}
2024-10-10 11:12:12,973 INFO sqlalchemy.engine.Engine INSERT INTO seminars VALUES ('python', '2024-08-01', '2024-12-01', 't08')
2024-10-10 11:12:12,998 INFO sqlalchemy.engine.Engine [generated in 0.02494s] {}
2024-10-10 11:12:13,030 INFO sqlalchemy.engine.Engine COMMIT

or

In [29]:
with engine.begin() as conn: # Done with echo=True
    conn.execute(text('''
                        TRUNCATE TABLE seminars; -- we need to empty the table due to Primary Key constraint
                        INSERT INTO seminars VALUES ('art', '2024-03-23', '2024-05-23', 't23');
                        INSERT INTO seminars VALUES ('ethics', '2024-03-17', '2024-04-05', 't12');
                        INSERT INTO seminars VALUES ('engineering', '2024-10-09', '2024-11-08', 't45');
                        INSERT INTO seminars VALUES ('politics', '2024-07-11', '2024-08-31', 't37');
                        INSERT INTO seminars VALUES ('python', '2024-08-01', '2024-12-01', 't08');                      
                    '''))

2024-10-10 11:12:25,649 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-10-10 11:12:25,679 INFO sqlalchemy.engine.Engine
                        TRUNCATE TABLE seminars; -- we need to empty the table due to Primary Key constraint
                        INSERT INTO seminars VALUES ('art', '2024-03-23', '2024-05-23', 't23');
                        INSERT INTO seminars VALUES ('ethics', '2024-03-17', '2024-04-05', 't12');
                        INSERT INTO seminars VALUES ('engineering', '2024-10-09', '2024-11-08', 't45');
                        INSERT INTO seminars VALUES ('politics', '2024-07-11', '2024-08-31', 't37');
                        INSERT INTO seminars VALUES ('python', '2024-08-01', '2024-12-01', 't08');

2024-10-10 11:12:25,686 INFO sqlalchemy.engine.Engine [generated in 0.00705s] {}
2024-10-10 11:12:25,750 INFO sqlalchemy.engine.Engine COMMIT

#### Side Bar: Transactions

>
>**engine.begin():**  
The statements withing the `with` block are executed as a *transaction*. A transaction bundles several SQL statements into a single atomic unit (all 'conn.execute()' are treated as a single transaction). If any query fails (e.g., due to an error or constraint violation), the entire transaction is rolled back, and none of the queries take effect. **It is all or nothing.**
>
This is called *atomicity* and is one of the key features of a relational database. To send the statements without transaction use `engine.connect()` instead of `engine.begin()`.
>
>**engine.connect():**  
Each `conn.execute()` line is treated as a separate transaction. If a query fails, it doesn‚Äôt affect other queries executed earlier. You need to explicitly handle the transactions (commit or rollback) for each individual query.

### üìö 3.3 Reading data

We can also run `SELECT` statements and store the result in a variable `result`  

The method `result.all()` reads all rows from the result object and returns a list
of tuples:

In [30]:
# let's read the newly created table

with engine.begin() as conn: # Done with echo=True
    result = conn.execute(text("SELECT * FROM seminars;"))
    seminars_data = result.all()

print(seminars_data)
#returns a list of tuples, each tuple being a row in the table

2024-10-10 11:28:23,251 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-10-10 11:28:23,272 INFO sqlalchemy.engine.Engine SELECT * FROM seminars;
2024-10-10 11:28:23,274 INFO sqlalchemy.engine.Engine [generated in 0.00232s] {}
2024-10-10 11:28:23,336 INFO sqlalchemy.engine.Engine COMMIT
[('art', datetime.date(2024, 3, 23), datetime.date(2024, 5, 23), 't23'), ('ethics', datetime.date(2024, 3, 17), datetime.date(2024, 4, 5), 't12'), ('engineering', datetime.date(2024, 10, 9), datetime.date(2024, 11, 8), 't45'), ('politics', datetime.date(2024, 7, 11), datetime.date(2024, 8, 31), 't37'), ('python', datetime.date(2024, 8, 1), datetime.date(2024, 12, 1), 't08')]

The list of rows can then be converted into a `pd.DataFrame`:

In [31]:
df = pd.DataFrame(seminars_data, columns=['seminar_name', 'seminar_start', 'seminar_end', 'instructor_id'])
# df.set_index('seminar_name')
df

  seminar_name seminar_start seminar_end instructor_id
0          art    2024-03-23  2024-05-23           t23
1       ethics    2024-03-17  2024-04-05           t12
2  engineering    2024-10-09  2024-11-08           t45
3     politics    2024-07-11  2024-08-31           t37
4       python    2024-08-01  2024-12-01           t08

In [32]:
# let's switch the logging off again. .
engine = create_engine(url, echo=False)

my_schema = 's_shaunkutsanzira'

with engine.begin() as conn: 
    result = conn.execute(text(f'SET search_path TO {my_schema};'))

# 4. Reading üìö and Writing ‚úèÔ∏è tables with pandas üêº

Pandas has some built-in tools to directly read data from a database into a DataFrame:

>**TEACHER's Note:**  
> if the cohort is not as strong read/query only one table, and then save it as another version of itself to the database.

In [33]:
# reading bands table into a dataframe

students = pd.read_sql(sql=text('SELECT * FROM students;'), con=engine)
# enrolments = pd.read_sql(sql=text('SELECT * FROM enrolments;'), con=engine.connect())
students

   student_id student_name             email
0           1         Anna    anna@gmail.com
1           2       Joseph  joseph@gmail.com
2           3       Scally  scally@gmail.com
3           4         Liam    liam@gmail.com
4           5         Elif    elif@gmail.com

In [34]:
# reading songs table into a dataframe

exam_scores = pd.read_sql(sql=text('SELECT * FROM exam_grades;'), con=engine)
exam_scores

  seminar_name  student_id  grade
0          art           5    1.3
1       ethics           2    1.0
2  engineering           4    2.1
3     politics           1    3.5
4          art           3    2.3

In [35]:
# let's merge bands and songs on "band_name"

student_scores = pd.merge(students, exam_scores, on=('student_id'), how='inner')
student_scores

   student_id student_name             email seminar_name  grade
0           1         Anna    anna@gmail.com     politics    3.5
1           2       Joseph  joseph@gmail.com       ethics    1.0
2           3       Scally  scally@gmail.com          art    2.3
3           4         Liam    liam@gmail.com  engineering    2.1
4           5         Elif    elif@gmail.com          art    1.3

In [36]:
# optionally adding student_id as index 
student_scores.set_index('student_id', inplace=True)
student_scores

           student_name             email seminar_name  grade
student_id
1                  Anna    anna@gmail.com     politics    3.5
2                Joseph  joseph@gmail.com       ethics    1.0
3                Scally  scally@gmail.com          art    2.3
4                  Liam    liam@gmail.com  engineering    2.1
5                  Elif    elif@gmail.com          art    1.3

#### With a one-liner, you can also import new data into the database:

In [37]:
student_scores.to_sql('student_grades', engine, if_exists='replace', index=True)

5

>#### Check your Schema in DBeaver for changes

In the background, this creates a new table with column definitions and inserts the data into the table.   
>**Note:** Check the data type of the columns. For example the last column `grade` is currently a **float8**

To get more control over the data types of the table 
you can run a `CREATE TABLE` statement before inserting data with pandas:

In [38]:
with engine.begin() as conn:
    conn.execute(text("DROP TABLE IF EXISTS student_grades_new;"))
    conn.execute(text("""
                        CREATE TABLE student_grades_new (
                                                    student_id INT,
                                                    student_name VARCHAR,
                                                    email VARCHAR,
                                                    seminar_name VARCHAR,
                                                    grade NUMERIC
                                                    );
                        """))
    student_scores.to_sql('student_grades_new', conn, if_exists='append', index='student_id') 
    # here we use the variable `conn` as this line is stil indented under the `with engine.begin() as conn`statement and is using the open connection to db.

> check now in DBeaver the data type of the columns.

In [40]:
# lets change the student name for student_id 1
with engine.connect() as conn:
    conn.execute(text("UPDATE student_grades_new SET student_name = 'John Doe' WHERE student_id = 1;"))

or we can define a **dictionary** with the data types and pass it to the pandas `.to_sql()` method. In this case would use the `engine` directly as we are not opening a connection within a `WITH` statement.

In [39]:
dtype_dict = {'student_id' : types.INTEGER(), 
              'student_name' : types.VARCHAR(),
              'email' : types.VARCHAR(),
              'seminar_name' : types.VARCHAR(),
              'grade' : types.NUMERIC()}

student_scores.to_sql('student_grades', engine, if_exists='replace', index='student_id', dtype=dtype_dict)

# https://docs-sqlalchemy.readthedocs.io/ko/latest/core/type_basics.html
# https://docs.sqlalchemy.org/en/20/core/type_basics.htm

5

#### And if we don't  like the `student_grades` table - we can simply drop it:

In [ ]:
with engine.begin() as conn:
    conn.execute(text("DROP TABLE IF EXISTS student_grades;"))

> ### Refresh the database in DBeaver.

1 Revision 
2 
3 .env creation
4 read the .env file
5 url creation
6 create engine
7 with engine.begin() as conn:
    result = conn.execute(text(f'SET search_path TO {my_schema};'))
8 or 
9 pd.read_sql(read data, insert or write your dataframe to the database)
df.to_sql('table_name', engine, if_exists='replace', index=True)

1  revision 
2 import pandas,import pandas, sqlalchemy, psycopg2-binary
1. .env creation
2. reading .env using dotenv package
3. url
4. create engine
5. with engine.begin as conn (update, drop, insert, read data)
        result = conn.execute ....
    OR
    pd.read_sql (read data, insert or write your dataframe)
    df.to_sql